Revit 2024 API
TableSectionData.SetCellFormatOptions Method
 Sets a cell's FormatOptions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void SetCellFormatOptions(
	int nRow,
	int nCol,
	FormatOptions options
)
Visual Basic
Public Sub SetCellFormatOptions ( _
	nRow As Integer, _
	nCol As Integer, _
	options As FormatOptions _
)
Visual C++
public:
void SetCellFormatOptions(
	int nRow,
	int nCol,
	FormatOptions^ options
)
Parameters
nRow
Type: System.Int32
 The row index of the cell
nCol
Type: System.Int32
 The column index of the cell
options
Type: Autodesk.Revit.DB.FormatOptions
 The format option to assign
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The given row number nRow is invalid. -or- The given column number nCol is invalid. -or- The display unit in options is not a valid display unit for the unit type of the cell, or the rounding method in options is not set to Nearest. See UnitUtils.IsValidDisplayUnit(UnitType, DisplayUnitType), UnitUtils.GetValidDisplayUnits(UnitType) and FormatOptions.RoundingMethod.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
TableSectionData Class
Autodesk.Revit.DB Namespace